# GetRuleDescription Method (PerformanceAdviserRuleId)

---
C#Visual BasicVisual C++
Revit 2024 API
---
PerformanceAdviser..::..GetRuleDescription Method (PerformanceAdviserRuleId)
PerformanceAdviser Class See Also
---
Retrieves the description of the rule.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public string GetRuleDescription(
	PerformanceAdviserRuleId id
)
```

Visual Basic
---
```text
Public Function GetRuleDescription ( _
	id As PerformanceAdviserRuleId _
) As String
```

Visual C++
---
```text
public:
String^ GetRuleDescription(
	PerformanceAdviserRuleId^ id
)
```

# ### Parameters
id
    Type: Autodesk.Revit.DB..::..PerformanceAdviserRuleId The rule id to get information for.
# ### Return Value
The description of the rule.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
PerformanceAdviser Class
GetRuleDescription Overload
Autodesk.Revit.DB Namespace